#+TITLE: November 9-22, 2018 (14 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO                                                 | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------------------------------------------------------+------+-------------+---------+--------------------------------------------------------------+----------|
| DEV.1538995712. [#A] Freecodecamp Javascript Algori  |      |             |         | READ.1542393796. Learning Golang Chapter 7. Int (2018-11-22) |          |
| READ.1538998440. [#A] MDN Javascript Guides          |      |             |         | DEV.1542394436. Learning Golang Chapter 7 Exer (2018-11-21)  |          |
| READ.1538996950. [#A] Linux for you and me           |      |             |         |                                                              |          |
| READ.1540535858. [#B] [[https://youtu.be/4XpnKHJAok8 |      |             |         |                                                              |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME           | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|----------------+-----------+--------+------+-----------+--------------+------------|
| Bhavin192      |      12.3 |  11.32 | 12.3 |         0 |   2018-11-23 | ########## |
| Vaibhavk       |         0 |      0 |    0 |         0 |   2018-11-23 | ---------- |
| Sidntrivedi012 |        10 |      0 |    0 |        10 |   2018-12-07 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  45 +---------------------------------------------------------------------+   
:     |    #########################################################        |   
:  40 |+   ....                                              ACTUAL #######+|   
:     |        .                                              IDEAL ....... |   
:  35 |+        .....                                                      +|   
:     |              .....                                             #####|   
:  30 |+                  .....                                            +|   
:     |                        .....                                        |   
:  25 |+                            ....                                   +|   
:     |                                 .                                   |   
:  20 |+                                 .....                             +|   
:     |                                       .....                         |   
:  15 |+                                           .....                   +|   
:     |                                                 .....               |   
:  10 |+                                                     ....          +|   
:     |                                                          .          |   
:   5 |+                                                          .....    +|   
:     |                                                                .....|   
:   0 +---------------------------------------------------------------------+   
:     0         2         4         6         8         10        12        14  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:14]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2018-11-09 |   42.3 |    39 |                 |
|   2 | 2018-11-10 |   42.3 |    36 |                 |
|   3 | 2018-11-11 |   42.3 |    33 |                 |
|   4 | 2018-11-12 |   42.3 |    30 |                 |
|   5 | 2018-11-13 |   42.3 |    27 |                 |
|   6 | 2018-11-14 |   42.3 |    24 |                 |
|   7 | 2018-11-15 |   42.3 |    21 |                 |
|   8 | 2018-11-16 |   42.3 |    18 |                 |
|   9 | 2018-11-17 |   42.3 |    15 |                 |
|  10 | 2018-11-18 |   42.3 |    12 |                 |
|  11 | 2018-11-19 |   42.3 |     9 |                 |
|  12 | 2018-11-20 |   42.3 |     6 |                 |
|  13 | 2018-11-21 |   33.0 |     3 | DEV.1542394436  |
|  14 | 2018-11-22 |   30.0 |     0 | READ.1542393796 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                   | TASKID          | OWNER          | PRIORITY | TODO | ESTIMATED | ACTUAL |
|--------------------------------------------------------+-----------------+----------------+----------+------+-----------+--------|
| TASKS                                                  |                 |                | B        |      |      42.3 |  11.32 |
|--------------------------------------------------------+-----------------+----------------+----------+------+-----------+--------|
| sidntrivedi012                                         |                 |                | B        |      |        10 |        |
| Freecodecamp Javascript Algorithms and Data Structures | DEV.1538995712  | sidntrivedi012 | A        | TODO |         7 |        |
| MDN Javascript Guides                                  | READ.1538998440 | sidntrivedi012 | A        | TODO |         1 |        |
| Linux for you and me                                   | READ.1538996950 | sidntrivedi012 | A        | TODO |         1 |        |
| [[https://youtu.be/4XpnKHJAok8][Linus Torvalds Git Tech Talk.]]                          | READ.1540535858 | sidntrivedi012 | B        | TODO |         1 |        |
|--------------------------------------------------------+-----------------+----------------+----------+------+-----------+--------|
| vaibhavk                                               |                 |                | B        |      |        20 |        |
| Computer Network                                       | READ.1541589764 | vaibhavk       | A        |      |         7 |        |
| [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch01][Control Groups]]                                         | READ.1541589889 | vaibhavk       | B        |      |         6 |        |
| [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]] - II                                    | DEV.1541590094  | vaibhavk       | B        |      |         7 |        |
|--------------------------------------------------------+-----------------+----------------+----------+------+-----------+--------|
| bhavin192                                              |                 |                | B        |      |      12.3 |  11.32 |
| Learning Golang Chapter 7. Interfaces                  | READ.1542393796 | bhavin192      | B        | DONE |         3 |   2.92 |
| Learning Golang Chapter 7 Exercises                    | DEV.1542394436  | bhavin192      | B        | DONE |       9.3 |   8.40 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2018-11-09 Fri>
  :wpd-sidntrivedi012: 1
  :wpd-vaibhavk: 1.5
  :wpd-bhavin192: 1
  :END:
** sidntrivedi012
*** TODO [#A] Freecodecamp Javascript Algorithms and Data Structures [0/1]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:
    :OWNER:    sidntrivedi012
    :ID:       DEV.1538995712
    :TASKID:   DEV.1538995712
    :END:      
    - [ ] Basic Javascript
*** TODO [#A] MDN Javascript Guides [0/2]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   
    :OWNER:    sidntrivedi012
    :ID:       READ.1538998440
    :TASKID:   READ.1538998440
    :END:      
     - [ ] Introduction                         (0.25)
     - [ ] Grammar and types			(0.75)
*** TODO [#A] Linux for you and me [0/1]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: sidntrivedi012
    :ID: READ.1538996950
    :TASKID: READ.1538996950
    :END:      
    - [ ] File System
*** TODO [#B] [[https://youtu.be/4XpnKHJAok8][Linus Torvalds Git Tech Talk.]]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: sidntrivedi012
    :ID: READ.1540535858
    :TASKID: READ.1540535858
    :END:
** vaibhavk
*** [#A] Computer Network [0/2]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:
    :OWNER: vaibhavk
    :ID: READ.1541589764
    :TASKID: READ.1541589764
    :END:
    - [ ] Chapter 5. Link Layer: Link, Access Network, LAN (3h)
    - [ ] Chapter 6. Wireless and Mobile Network (4h)
*** [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch01][Control Groups]] [0/4]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER:    vaibhavk
    :ID:       READ.1541589889
    :TASKID:   READ.1541589889
    :END:
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/sec-relationships_between_subsystems_hierarchies_control_groups_and_tasks][How and Why Cgroup]] (1h)
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch-using_control_groups][Using Cgroups]] (1h 30m)
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch-subsystems_and_tunable_parameters][Subsystems and Tunable Parameters]] (1h 30m)
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/control-group-application-examples][Applications examples]] (1h 30m)
*** [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]] - II [0/4]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:
    :OWNER: vaibhavk
    :ID: DEV.1541590094
    :TASKID: DEV.1541590094
    :END:
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial05/][Poll App, Part 5]] (2h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial06/][Poll App, Part 6]] (1h)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial07/][Poll App, Part 7]] (2h)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/reusable-apps/][Reusable Apps]] (1h 30m)
** bhavin192
*** DONE Learning Golang Chapter 7. Interfaces [6/6]
    CLOSED: [2018-11-22 Thu 19:15]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   2.92
    :OWNER:    bhavin192
    :ID:       READ.1542393796
    :TASKID:   READ.1542393796
    :END:
    :LOGBOOK:
    CLOCK: [2018-11-22 Thu 19:00]--[2018-11-22 Thu 19:15] =>  0:15
    CLOCK: [2018-11-21 Wed 19:30]--[2018-11-21 Wed 19:54] =>  0:24
    CLOCK: [2018-11-16 Fri 18:50]--[2018-11-16 Fri 18:58] =>  0:08
    CLOCK: [2018-11-16 Fri 18:23]--[2018-11-16 Fri 18:43] =>  0:20
    CLOCK: [2018-11-15 Thu 19:50]--[2018-11-15 Thu 19:57] =>  0:07
    CLOCK: [2018-11-15 Thu 18:47]--[2018-11-15 Thu 19:28] =>  0:41
    CLOCK: [2018-11-14 Wed 22:44]--[2018-11-14 Wed 23:05] =>  0:21
    CLOCK: [2018-11-14 Wed 21:59]--[2018-11-14 Wed 22:29] =>  0:30
    CLOCK: [2018-11-12 Mon 19:38]--[2018-11-12 Mon 19:47] =>  0:09
    :END:
    - [X] 7.2 Interface Types (10m)
    - [X] 7.3 Interface Satisfaction (25m)
    - [X] 7.4 Parsing Flags with flag.Value (15m)
    - [X] 7.5 Interface Values (50m)
    - [X] 7.6 Sorting with sort.Interface (40m)
    - [X] 7.7 The http.Handler Interface (40m)
*** DONE Learning Golang Chapter 7 Exercises [4/4]
    CLOSED: [2018-11-21 Wed 19:14]
    :PROPERTIES:
    :ESTIMATED: 9.3
    :ACTUAL:   8.40
    :OWNER:    bhavin192
    :ID:       DEV.1542394436
    :TASKID:   DEV.1542394436
    :END:
    :LOGBOOK:
    CLOCK: [2018-11-21 Wed 18:30]--[2018-11-21 Wed 19:14] =>  0:44
    CLOCK: [2018-11-20 Tue 22:21]--[2018-11-20 Tue 23:39] =>  1:18
    CLOCK: [2018-11-20 Tue 19:42]--[2018-11-20 Tue 19:51] =>  0:09
    CLOCK: [2018-11-19 Mon 23:36]--[2018-11-19 Mon 23:54] =>  0:18
    CLOCK: [2018-11-19 Mon 23:10]--[2018-11-19 Mon 23:26] =>  0:16
    CLOCK: [2018-11-18 Sun 19:32]--[2018-11-18 Sun 19:47] =>  0:15
    CLOCK: [2018-11-18 Sun 18:10]--[2018-11-18 Sun 18:39] =>  0:29
    CLOCK: [2018-11-18 Sun 15:16]--[2018-11-18 Sun 16:45] =>  1:29
    CLOCK: [2018-11-18 Sun 12:45]--[2018-11-18 Sun 13:17] =>  0:32
    CLOCK: [2018-11-14 Wed 23:06]--[2018-11-14 Wed 23:17] =>  0:11
    CLOCK: [2018-11-13 Tue 19:06]--[2018-11-13 Tue 19:52] =>  0:46
    CLOCK: [2018-11-12 Mon 22:16]--[2018-11-12 Mon 22:50] =>  0:34
    CLOCK: [2018-11-12 Mon 19:50]--[2018-11-12 Mon 19:59] =>  0:09
    CLOCK: [2018-11-11 Sun 22:33]--[2018-11-11 Sun 22:50] =>  0:17
    CLOCK: [2018-11-10 Sat 20:41]--[2018-11-10 Sat 21:07] =>  0:26
    CLOCK: [2018-11-10 Sat 20:02]--[2018-11-10 Sat 20:33] =>  0:31
    :END:
    - [X] 7.1 Part II (65m)
    - [X] 7.2 (90m)
    - [X] 7.4 (15m)
    - [X] 7.6 (6.5h)

